/***********************************************************
1，这一题正常的写是用if else
2，这里取了个巧，用一个数组存好 A B C D E, 然后处理输入，通过角标直接取结果
这样节省时间，对于大量的数据处理效果很好。
*************************************************************/
#include <stdio.h>
#include <stdlib.h>

int main()
{
    int in;
    char res[5] = {'E', 'D', 'C', 'B', 'A'};
    scanf("%d", &in);
    in -= 60;
    if(in < 0)
    {
        printf("E");
    }
    else if(in == 40)   //100的时候上面的数组访问越界了
    {
        printf("A");
    }
    else
    {
        printf("%c", res[in/10 + 1]);
    }
    return 0;
}
